In [4]:
import sqlite3 as lite 
import pandas as pd 
import os

1. In your folder, create a database named 0101lab_\<your folder name>.sqlite

In [12]:
con = lite.connect(f'0101lab_smaranrb.sqlite')

2. Create table using data from Assignments folder   
    - 'Books' using bookset.xlsx   
    - 'Users' using userset.xlsx   
    - 'Ratings' using ratingset.xlsx

In [8]:
df1 = pd.read_excel("G:/.shortcut-targets-by-id/1aBWQaFQhja65Ljp3SLszLrSLfIbp0hjJ/DBMS_Course/Assignments/bookset.xlsx")
df2 = pd.read_excel("G:/.shortcut-targets-by-id/1aBWQaFQhja65Ljp3SLszLrSLfIbp0hjJ/DBMS_Course/Assignments/userset.xlsx")
df3 = pd.read_excel("G:/.shortcut-targets-by-id/1aBWQaFQhja65Ljp3SLszLrSLfIbp0hjJ/DBMS_Course/Assignments/ratingset.xlsx")

In [13]:
df1.to_sql('books', con, index = False)
df2.to_sql('users', con, index = False)
df3.to_sql('ratings', con, index = False)

5

3. Verify that the tables have been created and contain the expected data

In [16]:
# con.execute("select * from books").fetchall()
pd.read_sql("select * from books", con)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,1841721522,New Vegetarian: Bold and Beautiful Recipes for...,Celia Brooks Brown,2001,Ryland Peters and Small Ltd
2,375759778,Prague : A Novel,ARTHUR PHILLIPS,2003,Random House Trade Paperbacks
3,425163091,Chocolate Jesus,Stephan Jaramillo,1998,Berkley Publishing Group

In [19]:
# con.execute("select * from users").fetchall()
pd.read_sql("select * from users", con)

   User-ID                                Location  Age
0        2               stockton, california, usa   18
1        4               porto, v.n.gaia, portugal   17
2        6           santa monica, california, usa   61
3       10              albacete, wisconsin, spain   26
4       11          melbourne, victoria, australia   14
5       13             barcelona, barcelona, spain   26
6       18  rio de janeiro, rio de janeiro, brazil   25
7       19                               weston, ,   14
8       20            langhorne, pennsylvania, usa   19

In [18]:
# con.execute("select * from ratings").fetchall()
pd.read_sql("select * from ratings", con)

   User-ID        ISBN  Book-Rating
0        2   195153448            0
1       10  1841721522            0
2       10  8477024456            6
3       19   375759778            7
4       20   425163091            0

4. Repeat the above steps using in-memory database.

In [20]:
con_mem = lite.connect(":memory:")

In [21]:
df2.to_sql('users', con_mem, index = False)

9

In [23]:
pd.read_sql_query("select * from users", con_mem)

   User-ID                                Location  Age
0        2               stockton, california, usa   18
1        4               porto, v.n.gaia, portugal   17
2        6           santa monica, california, usa   61
3       10              albacete, wisconsin, spain   26
4       11          melbourne, victoria, australia   14
5       13             barcelona, barcelona, spain   26
6       18  rio de janeiro, rio de janeiro, brazil   25
7       19                               weston, ,   14
8       20            langhorne, pennsylvania, usa   19

5. Using DB Browser, explore the table structure and write down the schema of each table in A4 sheet of paper and submit.